sterentev/atdf-device-asm-include/inc/ATmega32A.inc
;***********************************************************************
;***** THIS IS A MACHINE GENERATED FILE - DO NOT EDIT ******************
;*************** Script version: 0.07 **********************************
;*************** tab-width 8 *******************************************
;***********************************************************************
;
;* Target MCU        : ATmega32A
;* Title             : Register/Mask/Bit Definitions for the ATmega32A
;* File Name         : ATmega32A.inc
;* Source Date       : 2026-01-22 07:11:00 UTC
;* Make Date         : 2026-05-31 13:22:28 UTC
;
;***********************************************************************

#ifndef _ATMEGA32A_INC_
#define _ATMEGA32A_INC_

;***********************************************************************
;********************* NOTES *******************************************
;***********************************************************************
;
; - Registers marked [MEMORY MAPPED] are extended I/O ports
;   and cannot be used with IN/OUT instructions
; - Register bits are specified by a bit number (for a single bit)
;   xor by mask (for bits group). In case bits in a group are placed sequentially
;   to each other (no gaps) a number for the lower bit in the group is defined also.
; - When a set of bitmask values is listed for bits group,
;   use those values without bit shifting operation
; - Some bitmasks MCU developers split on 2+ chunks and placed separately
;   (sometime in different registers). Such bitmaps are placed in
;   'EXTRA BITFIELDS VALUES' section. Refer to docs where such bits should be set.
;
;***********************************************************************




; **********************************************************************
; ***************	DEVICE DEFINITIONS	************************
; **********************************************************************
;
.device	ATmega32A
.equ	JTAGID		= 0x0950203F
.equ	SIGNATURE0	= 0x1e
.equ	SIGNATURE1	= 0x95
.equ	SIGNATURE2	= 0x02


; ************* CPU REGISTERS DEFINITIONS ******************************
;
.def	XH	= r27
.def	XL	= r26
.def	YH	= r29
.def	YL	= r28
.def	ZH	= r31
.def	ZL	= r30



; **********************************************************************
; ***************	ADDR SPACES AND MAPPING	************************
; **********************************************************************
;
; ----------	PROG ADDRESS SPACE		------------------------
;   FLASH
.equ	ADDR_FLASH_START		= 0x0000
.equ	ADDR_FLASH_END			= 0x7FFF
.equ	ADDR_FLASH_SIZE			= 0x8000
;   BOOT_SECTION_1
.equ	ADDR_BOOT_SECTION_1_START	= 0x7E00
.equ	ADDR_BOOT_SECTION_1_END		= 0x7FFF
.equ	ADDR_BOOT_SECTION_1_SIZE	= 0x0200
;   BOOT_SECTION_2
.equ	ADDR_BOOT_SECTION_2_START	= 0x7C00
.equ	ADDR_BOOT_SECTION_2_END		= 0x7FFF
.equ	ADDR_BOOT_SECTION_2_SIZE	= 0x0400
;   BOOT_SECTION_3
.equ	ADDR_BOOT_SECTION_3_START	= 0x7800
.equ	ADDR_BOOT_SECTION_3_END		= 0x7FFF
.equ	ADDR_BOOT_SECTION_3_SIZE	= 0x0800
;   BOOT_SECTION_4
.equ	ADDR_BOOT_SECTION_4_START	= 0x7000
.equ	ADDR_BOOT_SECTION_4_END		= 0x7FFF
.equ	ADDR_BOOT_SECTION_4_SIZE	= 0x1000

; ----------	SIGNATURES ADDRESS SPACE	------------------------
;   SIGNATURES
.equ	ADDR_SIGNATURES_START		= 0x0000
.equ	ADDR_SIGNATURES_END		= 0x0002
.equ	ADDR_SIGNATURES_SIZE		= 0x0003

; ----------	FUSES ADDRESS SPACE		------------------------
;   FUSES
.equ	ADDR_FUSES_START		= 0x0000
.equ	ADDR_FUSES_END			= 0x0001
.equ	ADDR_FUSES_SIZE			= 0x0002

; ----------	LOCKBITS ADDRESS SPACE		------------------------
;   LOCKBITS
.equ	ADDR_LOCKBITS_START		= 0x0000
.equ	ADDR_LOCKBITS_END		= 0x0000
.equ	ADDR_LOCKBITS_SIZE		= 0x0001

; ----------	DATA ADDRESS SPACE		------------------------
;   REGISTERS
.equ	ADDR_REGISTERS_START		= 0x0000
.equ	ADDR_REGISTERS_END		= 0x001F
.equ	ADDR_REGISTERS_SIZE		= 0x0020
;   MAPPED_IO
.equ	ADDR_MAPPED_IO_START		= 0x0020
.equ	ADDR_MAPPED_IO_END		= 0x005F
.equ	ADDR_MAPPED_IO_SIZE		= 0x0040
;   IRAM
.equ	ADDR_IRAM_START			= 0x0060
.equ	ADDR_IRAM_END			= 0x085F
.equ	ADDR_IRAM_SIZE			= 0x0800

; ----------	EEPROM ADDRESS SPACE		------------------------
;   EEPROM
.equ	ADDR_EEPROM_START		= 0x0000
.equ	ADDR_EEPROM_END			= 0x03FF
.equ	ADDR_EEPROM_SIZE		= 0x0400

; ----------	OSCCAL ADDRESS SPACE		------------------------
;   OSCCAL
.equ	ADDR_OSCCAL_START		= 0x0000
.equ	ADDR_OSCCAL_END			= 0x0003
.equ	ADDR_OSCCAL_SIZE		= 0x0004




; **********************************************************************
; ***************	FUSES REGISTERS		************************
; **********************************************************************
;
.equ	HIGH		= 0x01
.equ	LOW		= 0x00


; ====	FUSE MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register HIGH bits		------------------------
.equ	OCDEN		= 7		; 0x80 - On-Chip Debug Enabled
.equ	JTAGEN		= 6		; 0x40 - JTAG Interface Enabled
.equ	SPIEN		= 5		; 0x20 - Serial program downloading (SPI) enabled
.equ	CKOPT		= 4		; 0x10 - Oscillator options
.equ	EESAVE		= 3		; 0x08 - Preserve EEPROM through the Chip Erase cycle
.equ	BOOTSZ_MASK	= 0x06		;      - Select Boot Size (2 bits)
.equ	BOOTSZ0		= 1		;          BOOTSZ BIT0 position
.equ	BOOTRST		= 0		; 0x01 - Boot Reset vector Enabled
; ::::  BOOTSZ	:::: bitfield values
;			0x06		; Boot Flash size=256 words start address=$3F00
;			0x04		; Boot Flash size=512 words start address=$3E00
;			0x02		; Boot Flash size=1024 words start address=$3C00
;			0x00		; Boot Flash size=2048 words start address=$3800

; ----------	Register LOW bits		------------------------
.equ	BODLEVEL	= 7		; 0x80 - Brownout detector trigger level
.equ	BODEN		= 6		; 0x40 - Brown-out detection enabled
.equ	SUT_CKSEL_MASK	= 0x3F		;      - Select Clock Source (6 bits)
.equ	SUT_CKSEL0	= 0		;          SUT_CKSEL BIT0 position
; ::::  BODLEVEL	:::: bitfield values
;			0x00		; Brown-out detection at VCC=4.0 V
;			0x80		; Brown-out detection at VCC=2.7 V
; ::::  SUT_CKSEL	:::: bitfield values
;			0x00		; Ext. Clock; Start-up time: 6 CK + 0 ms
;			0x10		; Ext. Clock; Start-up time: 6 CK + 4 ms
;			0x20		; Ext. Clock; Start-up time: 6 CK + 64 ms
;			0x01		; Int. RC Osc. 1 MHz; Start-up time: 6 CK + 0 ms
;			0x11		; Int. RC Osc. 1 MHz; Start-up time: 6 CK + 4 ms
;			0x21		; Int. RC Osc. 1 MHz; Start-up time: 6 CK + 64 ms; default value
;			0x02		; Int. RC Osc. 2 MHz; Start-up time: 6 CK + 0 ms
;			0x12		; Int. RC Osc. 2 MHz; Start-up time: 6 CK + 4 ms
;			0x22		; Int. RC Osc. 2 MHz; Start-up time: 6 CK + 64 ms
;			0x03		; Int. RC Osc. 4 MHz; Start-up time: 6 CK + 0 ms
;			0x13		; Int. RC Osc. 4 MHz; Start-up time: 6 CK + 4 ms
;			0x23		; Int. RC Osc. 4 MHz; Start-up time: 6 CK + 64 ms
;			0x04		; Int. RC Osc. 8 MHz; Start-up time: 6 CK + 0 ms
;			0x14		; Int. RC Osc. 8 MHz; Start-up time: 6 CK + 4 ms
;			0x24		; Int. RC Osc. 8 MHz; Start-up time: 6 CK + 64 ms
;			0x05		; Ext. RC Osc.         -  0.9 MHz; Start-up time: 18 CK + 0 ms
;			0x15		; Ext. RC Osc.         -  0.9 MHz; Start-up time: 18 CK + 4 ms
;			0x25		; Ext. RC Osc.         -  0.9 MHz; Start-up time: 18 CK + 64 ms
;			0x35		; Ext. RC Osc.         -  0.9 MHz; Start-up time: 6 CK + 4 ms
;			0x06		; Ext. RC Osc. 0.9 MHz -  3.0 MHz; Start-up time: 18 CK + 0 ms
;			0x16		; Ext. RC Osc. 0.9 MHz -  3.0 MHz; Start-up time: 18 CK + 4 ms
;			0x26		; Ext. RC Osc. 0.9 MHz -  3.0 MHz; Start-up time: 18 CK + 64 ms
;			0x36		; Ext. RC Osc. 0.9 MHz -  3.0 MHz; Start-up time: 6 CK + 4 ms
;			0x07		; Ext. RC Osc. 3.0 MHz -  8.0 MHz; Start-up time: 18 CK + 0 ms
;			0x17		; Ext. RC Osc. 3.0 MHz -  8.0 MHz; Start-up time: 18 CK + 4 ms
;			0x27		; Ext. RC Osc. 3.0 MHz -  8.0 MHz; Start-up time: 18 CK + 64 ms
;			0x37		; Ext. RC Osc. 3.0 MHz -  8.0 MHz; Start-up time: 6 CK + 4 ms
;			0x08		; Ext. RC Osc. 8.0 MHz - 12.0 MHz; Start-up time: 18 CK + 0 ms
;			0x18		; Ext. RC Osc. 8.0 MHz - 12.0 MHz; Start-up time: 18 CK + 4 ms
;			0x28		; Ext. RC Osc. 8.0 MHz - 12.0 MHz; Start-up time: 18 CK + 64 ms
;			0x38		; Ext. RC Osc. 8.0 MHz - 12.0 MHz; Start-up time: 6 CK + 4 ms
;			0x09		; Ext. Low-Freq. Crystal; Start-up time: 1K CK + 4 ms
;			0x19		; Ext. Low-Freq. Crystal; Start-up time: 1K CK + 64 ms
;			0x29		; Ext. Low-Freq. Crystal; Start-up time: 32K CK + 64 ms
;			0x0A		; Ext. Crystal/Resonator Low Freq.; Start-up time: 258 CK + 4 ms
;			0x1A		; Ext. Crystal/Resonator Low Freq.; Start-up time: 258 CK + 64 ms
;			0x2A		; Ext. Crystal/Resonator Low Freq.; Start-up time: 1K CK + 0 ms
;			0x3A		; Ext. Crystal/Resonator Low Freq.; Start-up time: 1K CK + 4 ms
;			0x0B		; Ext. Crystal/Resonator Low Freq.; Start-up time: 1K CK + 64 ms
;			0x1B		; Ext. Crystal/Resonator Low Freq.; Start-up time: 16K CK + 0 ms
;			0x2B		; Ext. Crystal/Resonator Low Freq.; Start-up time: 16K CK + 4 ms
;			0x3B		; Ext. Crystal/Resonator Low Freq.; Start-up time: 16K CK + 64 ms
;			0x0C		; Ext. Crystal/Resonator Medium Freq.; Start-up time: 258 CK + 4 ms
;			0x1C		; Ext. Crystal/Resonator Medium Freq.; Start-up time: 258 CK + 64 ms
;			0x2C		; Ext. Crystal/Resonator Medium Freq.; Start-up time: 1K CK + 0 ms
;			0x3C		; Ext. Crystal/Resonator Medium Freq.; Start-up time: 1K CK + 4 ms
;			0x0D		; Ext. Crystal/Resonator Medium Freq.; Start-up time: 1K CK + 64 ms
;			0x1D		; Ext. Crystal/Resonator Medium Freq.; Start-up time: 16K CK + 0 ms
;			0x2D		; Ext. Crystal/Resonator Medium Freq.; Start-up time: 16K CK + 4 ms
;			0x3D		; Ext. Crystal/Resonator Medium Freq.; Start-up time: 16K CK + 64 ms
;			0x0E		; Ext. Crystal/Resonator High Freq.; Start-up time: 258 CK + 4 ms
;			0x1E		; Ext. Crystal/Resonator High Freq.; Start-up time: 258 CK + 64 ms
;			0x2E		; Ext. Crystal/Resonator High Freq.; Start-up time: 1K CK + 0 ms
;			0x3E		; Ext. Crystal/Resonator High Freq.; Start-up time: 1K CK + 4 ms
;			0x0F		; Ext. Crystal/Resonator High Freq.; Start-up time: 1K CK + 64 ms
;			0x1F		; Ext. Crystal/Resonator High Freq.; Start-up time: 16K CK + 0 ms
;			0x2F		; Ext. Crystal/Resonator High Freq.; Start-up time: 16K CK + 4 ms
;			0x3F		; Ext. Crystal/Resonator High Freq.; Start-up time: 16K CK + 64 ms




